Repository: ramiroencinas/perl6doc-es
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: es_es

source: The method C<interval> returns a new C<on-demand> supply which periodically emits a new event at the specified interval.
es_es: El método C<interval> devuelve un nuevo suministro C<a demanda> que emitirá un evento nuevo con la frecuencia indicada.

source: The methods that return a promise that will be kept or broken automatically such as C<in> or C<start> will do this, so it is not necessary to do it for these.
es_es: Los métodos que devuelven una promesa como C<in> o C<start> donde directamente producen la consecución o la excepción de la promesa hacen esto mismo, por lo que no es necesario en esos casos el uso del método L<Vow>.

source: The most general syntax error, if no more specific error message can be given.
es_es: El error sintáctico más general, si no se indican mensajes de error más específicos.

source: The next level of the concurrency API is supplied by classes that implement the interface defined by the role L<Scheduler>.
es_es: El siguiente nivel de la API sobre concurrencia lo ofrecen las clases que implementan la interface definida por el rol L<Scheduler>.

source: The path to the command as well as any arguments to the command are supplied to the constructor.
es_es: Tanto la ubicación del comando como sus parámetros se proporcionan al constructor.

source: The primary interface of a scheduler (indeed the only method required by the L<Scheduler> interface) is the C<cue> method:
es_es: La interface principal de un programador (en realidad el único método requerido por la interface L<Scheduler>) es el método C<cue>:

source: The primary interface to L<Lock> is the method L<protect|/type/Lock#method_protect> which ensures that a block of code (commonly called a "critical section",) is only executed in one thread at a time:
es_es: La interface principal de L<Lock> es el método L<protect|/type/Lock#method_protect>, el cual se asegura de que un bloque de código (normalmente denominado "sección crítica") solamente se ejecuta en un momento dado en un hilo:

source: The simplest fix is to use a <Lock> to protect the critical section .
es_es: La solución más simple es utilizar un <Lock> para proteger la sección crítica.

source: The standard output and standard error of the program are available as L<Supply> objects from the methods L<stdout|/type/Proc::Async#method_stdout> and L<stderr|/type/Proc::Async#method_stderr> respectively which can be tapped as required.
es_es: La salida estándar y la salida estándar de errores del comando quedarán disponibles en los métodos L<stdout|/type/Proc::Async#method_stdout> y L<stderr|/type/Proc::Async#method_stderr> del objeto L<Promesa> correspondiente. Ambos métodos utilizan a su vez el método tap para acceder a la salida correspondiente.

source: The third line is the critical section as that is when the array is extended.
es_es: La sección crítica es la tercera línea, donde se extiende el array.

source: There is also the non-blocking L<method poll|/type/Channel#method_poll> which returns an available item from the channel or L<Nil> if there is no item or the channel is closed, this does of course mean that the channel must be checked to determine whether it is closed:
es_es: Existe el L<method poll|/type/Channel#method_poll> no bloqueante que devuelve un elemento disponible del canal o L<Nil> si no hay elementos o si el canal está cerrado. Esto implica comprobar el estado del canal para ver si está cerrado o no.

source: These are:
es_es: Son los siguientes:

source: This could also be written using the C<react> keyword:
es_es: Esto mismo también puede escribirse mediante la palabra clave C<react>:

source: This could also be written using the X<C<react>> keyword:
es_es: Esto puede escribirse mediante la palabra clave X<C<react>>:

source: This could be used, for instance, to fan-out a L<Supply> to one or more L<Channel>s to provide for different interfaces in a program.
es_es: Esto puede utilizarse, por ejemplo, para dirigir los resultados de un L<Suministro> a uno o más L<Canales> para distintos interfaces de un programa.

source: This exception is thrown when a piece of code tries to reuse a C<Seq> which has already been iterated.
es_es: Esta excepción se lanza cuando una parte del código intenta reutilizar C<Seq>, pero que ya terminó sus iteraciones.

source: This exception is thrown when code tries to keep/break an already vowed promise without going through the corresponding C<Vow> object.
es_es: Esta excepción se lanza cuando el código intenta mantener/romper una promesa ya jurada, sin pasar a través del correspondiente objeto C<Vow>.

source: This is considered to be such a commonly required pattern that it is also provided as subroutines:
es_es: El siguiente código es considerado como un patrón común que también es presentado como una subrutina:

source: This means that L<#method cue> blocks until the code has finished executing.
es_es: Esto significa que L<#method cue> bloquea hasta que el código se termina de ejecutar.

source: This means that L<method cue|/type/Scheduler#method cue> blocks until the code has finished executing.
es_es: Esto significa que L<method cue|/type/Scheduler#method cue> bloquea hasta que el código se termina de ejecutar.

source: This role does not provide any additional methods.
es_es: Este rol no proporciona ningún método adicional.

source: This sub-class of L<IO::Spec> specific to QNX will be available via C<$*SPEC> if the perl is running on QNX.
es_es: Esta sub-clase de L<IO::Spec> específica a QNX estará disponible a través de C<$*SPEC> si perl se ejecuta sobre QNX.

source: This sub-class of L<IO::Spec> will be available from the C<$*SPEC> variable for a perl running on C<Cygwin> .
es_es: Esta sub-clase de L<IO::Spec> estará disponible a partir de la variable C<$*SPEC> en un perl que se ejecute sobre C<Cygwin> .

source: This type object is an "empty instance" of the class.
es_es: Este tipo de objeto es una "instancia vacía" de la clase.

source: This will schedule the L<Callable> in C<&code> to be executed in the manner determined by the adverbs (as documented in L<Scheduler>) using the execution scheme as implemented by the scheduler.
es_es: Este método ejecutará C<&code> en forma de L<Callable> según determine el resto de parámetros (como indica la documentación de L<Scheduler>) utilizando el esquema de ejecución que implemente el programador.

source: Threads should be considered, for all intents, largely un-managed and their direct use should be avoided in user code.
es_es: A todos los efectos los hilos deben considerarse en gran medida como no administrados y debería evitarse su uso directo.

source: Thrown when a C<return> is called from outside a routine.
es_es: Se lanza cuando un C<return> se llama desde fuera de una rutina.

source: Thrown when a piece of stub code (created via C<!!!> or C<...>) is executed.
es_es: Se lanza cuando se ejecuta código talonero (creado con C<!!!> o C<...>).

source: Thus
es_es: Por lo tanto

source: Thus,
es_es: Por lo tanto,

source: Type objects are I<undefined>, in the sense that they return C<False> if you call the C<.defined> method on them.
es_es: Los tipos de objetos están I<indefinidos>, de forma que si en ellos realizas una llamada al método C<.defined> obtendrás C<False>.

source: Unlike C<await> however the results of the original kept promises are not available without referring to the original, so these are more useful when the completion or otherwise of the tasks is more important to the consumer than the actual results, or when the results have been collected by other means.
es_es: Sin embargo, con C<await> es necesario hacer referencia a las promesas originales que han finalizado para obtener sus resultados. Este caso es más util, por ejemplo, cuando es más importante averiguar si las promesas han finalizado que la obtención de sus resultados, o cuando los resultados se obtienen por otros medios.

source: What happened?
es_es: ¿Qué pasó?

source: When an L<Array> or a L<Hash> entry is initially assigned the underlying structure is altered and that operation is not async safe.
es_es: Cuando se asigna inicialmente un elemento de un L<Array> o de un L<Hash> la estructura subyacente cambia y esa operación es insegura asincrónicamente.

source: Which will give True if all of the promises were kept with True, False otherwise.
es_es: De forma que devolverá True si todas las promesas del array finalizan sin excepciones, o False en caso contrario.

source: You are free, though, to provide your own construction and build implementation.
es_es: Además puedes crear tus propios constructores y construir una implementación.

source: You can use this method to find out if a given object is a type object or not:
es_es: Puedes utilizar este método para saber si un objeto dado es de tipo objeto o no:

source: You may, for example, want to create a dependent Promise that will examine each of the original promises:
es_es: Por ejemplo, puedes crear una promesa que compruebe la consecución o no de una serie de promesas alojadas en un array:

source: You've already seen these in previous chapters.
es_es: Ya lo habrás visto en apartados anteriores.

source: Z Separator
es_es: Z Separator (separador)

source: Zl Line_Separator
es_es: Zl Line_Separator (separador de línea)

source: Zp Paragraph_Separator
es_es: Zp Paragraph_Separator (separador de párrafo)

source: Zs Space_Separator
es_es: Zs Space_Separator (separador de espacio)

source: and
es_es: y

source: await $promise;
es_es: await $promesa;

source: but
es_es: pero

source: class Point {
es_es: class Punto {

source: class Rectangle {
es_es: class Rectángulo {

source: class Task {
es_es: class Tarea {

source: dies with
es_es: muere con

source: doit();
es_es: hazlo();

source: done => { say 'Job is done.' },
es_es: done => { say 'Trabajo finalizado.' },

source: elsif $closed {
es_es: elsif $cerrado {

source: for $channel.list -> $r {
es_es: for $canal.list -> $r {

source: h interpret integer as C type "short" or
es_es: h interpreta un entero como un "short" o

source: has Bool $.done;
es_es: has Bool $.realizado;

source: has Point $.lower;
es_es: has Punto $.inferior;

source: has Point $.upper;
es_es: has Point $.superior;

source: has Task @!dependencies;
es_es: has Tarea @!dependencias;

source: hello
es_es: hola

source: hh interpret integer as C type "char" or "unsigned
es_es: hh interpreta un entero como un "char" o "unsigned

source: if $c.poll -> $item {
es_es: if $c.poll -> $elemento {

source: is equivalent to
es_es: es equivalente a

source: l interpret integer as C type "long" or
es_es: l interpreta un entero como un "long" o

source: method add-dependency(Task $dependency) {
es_es: method agregar-dependencia(Tarea $dependencia) {

source: method area() returns Int {
es_es: method área() returns Int {

source: method new(&callback, *@dependencies) {
es_es: method new(&callback, *@dependencias) {

source: method perform() {
es_es: method ejecutar() {

source: my $answer = 42;
es_es: my $respuesta = 42;

source: my $cancellation = $*SCHEDULER.cue({ say $i++}, every => 2 );
es_es: my $cancelación = $*SCHEDULER.cue({ say $i++}, every => 2 );

source: my $channel = $supply.Channel;
es_es: my $canal = $suministro.Channel;

source: my $channel = Channel.new;
es_es: my $canal = Channel.new;

source: my $closed = $c.closed;
es_es: my $cerrado = $c.closed;

source: my $count = 0;
es_es: my $cuenta = 0;

source: my $even_supply = $supply.grep({ not $_ % 2 });
es_es: my $suministro_par = $suministro.grep({ not $_ % 2 });

source: my $half_supply = $supply.map({ $_ / 2 });
es_es: my $medio_suministro = $supply.map({ $_ / 2 });

source: my $lock = Lock.new;
es_es: my $bloqueo = Lock.new;

source: my $odd_supply = $supply.grep({ $_ % 2 });
es_es: my $suministro_impar = $suministro.grep({ $_ % 2 });

source: my $p2 = Promise.new; $p2.break('oh no'); say $p2.status; # Broken say $p2.result; # dies with "oh no" =end code
es_es: my $p2 = Promise.new; $p2.break('oh no'); say $p2.status; # Rotura say $p2.result; # muere con "oh no" =end code

source: my $promise = $proc.start;
es_es: my $promesa = $proc.start;

source: my $promise = Promise.allof(
es_es: my $promesa = Promise.allof(

source: my $promise = Promise.anyof(
es_es: my $promesa = Promise.anyof(

source: my $promise = Promise.new;
es_es: my $promesa = Promise.new;

source: my $promise = Promise.start(
es_es: my $promesa = Promise.start(

source: my $promise = Promise.start({ die "Broken Promise" });
es_es: my $promesa = Promise.start({ die "Promesa Rota" });

source: my $promise = get_promise();
es_es: my $promesa = get_promesa();

source: my $promise = start {
es_es: my $promesa = start {

source: my $promise1 = Promise.in(5);
es_es: my $promesa1 = Promise.in(5);

source: my $promise1 = Promise.new();
es_es: my $promesa1 = Promise.new();

source: my $promise2 = $promise1.then(
es_es: my $promesa2 = $promesa2.then(

source: my $promise2 = $promise1.then(-> $v { say "Handled but : "; say $v.result});
es_es: my $promesa2 = $promesa1.then(-> $v { say "Handled but : "; say $v.result});

source: my $promise2 = $promise1.then(-> $v { say $v.status; 'Second Result' });
es_es: my $promesa2 = $promesa1.then(-> $v { say $v.status; 'Segundo Resultado' });

source: my $r = Rectangle.new(lower => Point.new(x => 0, y => 0), upper => Point.new(x => 10, y => 10));
es_es: my $r = Rectángulo.new(inferior => Punto.new(x => 0, y => 0), superior => Punto.new(x => 10, y => 10));

source: my $result = await $promise;
es_es: my $resultado = await $promesa;

source: my $supplier = Supplier.new;
es_es: my $proveedor = Supplier.new;

source: my $supply = $supplier.Supply;
es_es: my $suministro = $proveedor.Supply;

source: my $supply = Supply.interval(2);
es_es: my $suministro = Supply.interval(2);

source: my $supply = supply {
es_es: my $suministro = supply {

source: my $tap = $supply.tap( -> $v { say $v });
es_es: my $tap = $suministro.tap( -> $v { say $v });

source: my $thread = Thread.new(code => { for 1 ..
es_es: my $hilo = Thread.new(code => { for 1 ..

source: my $thread = Thread.start({ for 1 ..
es_es: my $hilo = Thread.start({ for 1 ..

source: my $vow = $promise.vow;
es_es: my $vow = $promesa.vow;

source: my @data;
es_es: my @datos;

source: my @promises;
es_es: my @promesas;

source: my @result = await $p1, $p2;
es_es: my @resultado = await $p1, $p2;

source: or
es_es: o bien

source: or even
es_es: o incluso

source: outputs
es_es: produce como salida:

source: perlsyn - Perl syntax
es_es: perlsyn - Sintaxis de Perl

source: prefix non-zero binary with "0b" or "0B"
es_es: prefija binarios no cero con "0b" o "0B"

source: prefix non-zero hexadecimal with "0x" or "0X",
es_es: prefija hexadecimales no ceros con "0x" o "0X",

source: prints
es_es: imprime

source: produces
es_es: produce

source: push @!dependencies, $dependency;
es_es: push @!dependencias, $dependencia;

source: push @promises, start {
es_es: push @promesas, start {

source: q, L, or ll interpret integer as C type "long long",
es_es: q, L, o ll interpreta un entero como un tipo C "long long",

source: return self.bless(:&callback, :@dependencies);
es_es: return self.bless(:&callback, :@dependencias);

source: say "All done"; # Should be about 3 seconds later
es_es: say "Todo listo"; # Debería tardar unos 3 segundos

source: say "All done"; # Should be not much more than three seconds later
es_es: say "Todo listo"; # No debería tardar más de tres segundos

source: say "Done.";
es_es: say "Realizado.";

source: say "Ordinary, defined object";
es_es: say "Normal, objeto definido";

source: say "Starting...";
es_es: say "Iniciando...";

source: say "Type object";
es_es: say "Tipo objeto";

source: say "via Channel: $item";
es_es: say "vía Canal: $elemento";

source: say $channel.receive; # 'Channel One'
es_es: say $canal.receive; # 'Canal Uno'

source: say $item;
es_es: say $elemento;

source: say $promise.cause;
es_es: say $promesa.cause;

source: say $promise.result; # 55
es_es: say $promesa.result; # 55

# say $promise2.cause; # Handled but : First Result
source: say $promise2.cause; # Handled but : \n First Result
es_es: say $promesa2.cause; # Controlado pero : \n Primer Resultado

source: say $promise2.result;
es_es: say $promesa2.result;

# say $promise2.result; # First Result Second Result
source: say $promise2.result; # First Result \n Second Result
es_es: say $promesa2.result; # Primer Resultado \n Segundo Resultado

source: say $r.area(); # -> 100
es_es: say $r.área(); # -> 100

source: say $result;
es_es: say $resultado;

source: say @result; # 55 -55
es_es: say @resultado; # 55 -55

source: say await Promise.allof(@promises).then({ so all(@promises>>.result) });
es_es: say await Promise.allof(@promesas).then({ so all(@promesas>>.result) });

source: should only output 0 to 5,
es_es: debería visualizar solo de 0 a 5,

source: space prefix non-negative number with a space
es_es: espacio prefija un número no negativo con un espacio

source: sub get_promise {
es_es: sub get_promesa {

source: submethod BUILD(:&!callback, :@!dependencies) { }
es_es: submethod BUILD(:&!callback, :@!dependencias) { }

source: try $promise.result;
es_es: try $promesa.result;

source: try $promise2.result;
es_es: try $promesa2.result;

source: unless $!done {
es_es: unless $!realizado {

source: when X::MyApp::Error { say "App Error: ", $_.message }
es_es: when X::MyApp::Error { say "Error: ", $_.message }

source: whenever $channel -> $item {
es_es: whenever $canal -> $elemento {

source: whenever $channel {
es_es: whenever $canal {

source: whenever $supply {
es_es: whenever $suministro {

source: which is equivalent to
es_es: que es equivalente a

source: which prints
es_es: que imprime

source: which produces:
es_es: que produce:
